In [30]:
import pandas as pd

col_names = ['year','one','tens','someyear','2o','tt']
df = pd.read_csv("data.csv", header=None, names=col_names, na_values=-1, parse_dates=[[0,1,2]])
df.to_excel('dataaa.xlsx', index=False)
dfe = pd.read_excel('dataaa.xlsx')
dfe

  year_one_tens  someyear    2o  tt
0    1818-01-11  1818.004   NaN   1
1    1818-01-12  1818.034   NaN   1
2    1818-01-13  1818.037  22.0   1
3    1818-01-14  1818.012  32.0   1
4    1818-01-15  1818.032   NaN   1
5    1818-01-16  1818.026   NaN   1
6    1818-01-17  1818.056  54.0   1
7    1818-01-18  1818.076   NaN   1
8    1818-01-19  1818.088  34.0   1

In [44]:
tx = pd.read_fwf('data.txt',index_col=False, header=None)
print(tx)

            0         1     2  3
0  1818-01-11  1818.004   NaN  1
1  1818-01-12  1818.034   NaN  1
2  1818-01-13  1818.037  22.0  1
3  1818-01-14  1818.012  32.0  1
4  1818-01-15  1818.032   NaN  1
5  1818-01-16  1818.026   NaN  1
6  1818-01-17  1818.056  54.0  1
7  1818-01-18  1818.076   NaN  1
8  1818-01-19  1818.088  34.0  1